import type { Feature } from './types';
import { StoreIcon, IndustryIcon, RestaurantIcon, HotelIcon, SalesIcon, ProductionIcon, WarehouseIcon, FinanceIcon, PayrollIcon, CurrencyIcon, TreasuryIcon, FacilitiesIcon } from './components/Icons';

export const navLinks = [
  { name: 'صفحه اصلی', href: '#' },
  { 
    name: 'محصولات', 
    href: '#',
    sublinks: [
        { name: 'نرم افزار فروشگاهی', href: '#' },
        { name: 'نرم افزار صنعتی', href: '#' },
        { name: 'نرم افزار رستورانی', href: '#' },
    ]
  },
  { 
    name: 'خدمات پشتیبانی', 
    href: '#',
    sublinks: [
        { name: 'پشتیبانی آنلاین', href: '#' },
        { name: 'مرکز دانلود', href: '#' },
    ]
  },
  { name: 'آموزش', href: '#' },
  { name: 'آموزشگاه سینتا', href: '#' },
  { name: 'درباره ما', href: '#' },
  { name: 'تماس با ما', href: '#' },
];

export const topFeatures: Feature[] = [
  {
    icon: StoreIcon,
    title: 'امکانات نرم افزار فروشگاهی',
    points: [
      'انتقال اطلاعات آفلاین و آنلاین در سطوح مختلف عملیاتی بین شعب صندوق',
      'اتصال به پنل پیامک اینترنتی و ارسال فاکتور و صورت حساب مشتری به صورت پیامک و لینک',
    ],
  },
  {
    icon: IndustryIcon,
    title: 'امکانات نرم افزار صنعتی',
    points: [
      'تعریف ساختار حسابها با عمق سه سطح و در هر سطح تا نه رقم کد حساب',
      'تعریف ساختار تفضیلی های شناور درختی مجزا با عمق سی سطح و تا نه رقم کد تفضیلی',
    ],
  },
    {
    icon: RestaurantIcon,
    title: 'امکانات نرم افزار رستورانی',
    points: [
        'راحت و سریع بودن کار با سفارش گیر ویندوز',
        'قابلیت تعریف فرمول ساخت برای محصولات'
    ]
  },
  {
    icon: HotelIcon,
    title: 'امکانات نرم افزار هتلداری',
    points: [
      'امکان تعریف نامحدود اتاق باظرفیت های مختلف',
      'تعریف انواع مشتری و تعیین نرخ اتاق ها برحسب نوع مشتری',
    ],
  },
];

export const allFeatures: Feature[] = [
    {
        icon: SalesIcon,
        title: 'امکانات سیستم خرید و فروش',
        points: ['امکان ثبت فاکتور فروش با قیمت گذاری های مختلف از قبل تعیین شده', 'امکان ثبت دو نوع سند تولید براساس فرمول تولید و بدون فرمول']
    },
    {
        icon: ProductionIcon,
        title: 'امکانات سیستم تولید',
        points: ['تعریف فرمول تولید با دقت بالا', 'امکان ثبت دو نوع سند تولید براساس فرمول تولید و بدون فرمول']
    },
    {
        icon: WarehouseIcon,
        title: 'امکانات انبارداری',
        points: ['امکان انبارداری به هر دو روش ادواری و دائمی', 'محاسبه موجودی پایان دوره براساس میانگین موزون و لحظه']
    },
    {
        icon: FinanceIcon,
        title: 'امکانات سیستم مالی',
        points: ['معرفی سرفصل حسابها در سطح گروه، کل، معین، تفصیلی به همراه دوسطح شناور مرکز هزینه و مرکز پروژه', 'امکان محاسبه و ثبت سند سود و زیان به صورت اتوماتیک']
    },
    {
        icon: PayrollIcon,
        title: 'امکانات سیستم حقوق و دستمزد',
        points: ['ثبت تمامی اطلاعات پرسنل جهت بایگانی و کارگزینی', 'امکان تعریف مزایا و کسورات به تعداد نامحدود به همراه فرمول نویسی']
    },
    {
        icon: CurrencyIcon,
        title: 'امکانات سیستم ارزی',
        points: ['امکان گزارش صورتحساب ارزی', 'امکان تسعیر ارز و ثبت سند هزینه و درآمدهای حاصل از تسعیر ارزی']
    },
    {
        icon: TreasuryIcon,
        title: 'امکانات سیستم خزانه داری',
        points: ['امکان چاپ برگه چک پرداختی و فیش واگذاری چک به بانک', 'امکان چاپ چک بر روی برگه چک']
    },
    {
        icon: FacilitiesIcon,
        title: 'امکانات سیستم تسهیلات',
        points: ['امکان ثبت وام های پرداختی شرکت و یادآوری اقساط وام های پرداختی و دریافتی', 'امکان تقسیم سود سال گذشته به سهام داران شرکت براساس معدل حساب سرمایه هر سهامدار']
    }
]
